GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k40.inc
// Register: RX1PPS
#define RX1PPS RX1PPS
RX1PPS                                   equ 0EB5h
// bitfield definitions
RX1PPS_PIN_POSN                          equ 0000h
RX1PPS_PIN_POSITION                      equ 0000h
RX1PPS_PIN_SIZE                          equ 0003h
RX1PPS_PIN_LENGTH                        equ 0003h
RX1PPS_PIN_MASK                          equ 0007h
RX1PPS_PORT_POSN                         equ 0003h
RX1PPS_PORT_POSITION                     equ 0003h
RX1PPS_PORT_SIZE                         equ 0002h
RX1PPS_PORT_LENGTH                       equ 0002h
RX1PPS_PORT_MASK                         equ 0018h
RX1PPS_RXPPS_POSN                        equ 0000h
RX1PPS_RXPPS_POSITION                    equ 0000h
RX1PPS_RXPPS_SIZE                        equ 0005h
RX1PPS_RXPPS_LENGTH                      equ 0005h
RX1PPS_RXPPS_MASK                        equ 001Fh
RX1PPS_RXPPS0_POSN                       equ 0000h
RX1PPS_RXPPS0_POSITION                   equ 0000h
RX1PPS_RXPPS0_SIZE                       equ 0001h
RX1PPS_RXPPS0_LENGTH                     equ 0001h
RX1PPS_RXPPS0_MASK                       equ 0001h
RX1PPS_RXPPS1_POSN                       equ 0001h
RX1PPS_RXPPS1_POSITION                   equ 0001h
RX1PPS_RXPPS1_SIZE                       equ 0001h
RX1PPS_RXPPS1_LENGTH                     equ 0001h
RX1PPS_RXPPS1_MASK                       equ 0002h
RX1PPS_RXPPS2_POSN                       equ 0002h
RX1PPS_RXPPS2_POSITION                   equ 0002h
RX1PPS_RXPPS2_SIZE                       equ 0001h
RX1PPS_RXPPS2_LENGTH                     equ 0001h
RX1PPS_RXPPS2_MASK                       equ 0004h
RX1PPS_RXPPS3_POSN                       equ 0003h
RX1PPS_RXPPS3_POSITION                   equ 0003h
RX1PPS_RXPPS3_SIZE                       equ 0001h
RX1PPS_RXPPS3_LENGTH                     equ 0001h
RX1PPS_RXPPS3_MASK                       equ 0008h
RX1PPS_RXPPS4_POSN                       equ 0004h
RX1PPS_RXPPS4_POSITION                   equ 0004h
RX1PPS_RXPPS4_SIZE                       equ 0001h
RX1PPS_RXPPS4_LENGTH                     equ 0001h
RX1PPS_RXPPS4_MASK                       equ 0010h
RX1PPS_RX1PPS_POSN                       equ 0000h
RX1PPS_RX1PPS_POSITION                   equ 0000h
RX1PPS_RX1PPS_SIZE                       equ 0005h
RX1PPS_RX1PPS_LENGTH                     equ 0005h
RX1PPS_RX1PPS_MASK                       equ 001Fh
RX1PPS_RX1PPS0_POSN                      equ 0000h
RX1PPS_RX1PPS0_POSITION                  equ 0000h
RX1PPS_RX1PPS0_SIZE                      equ 0001h
RX1PPS_RX1PPS0_LENGTH                    equ 0001h
RX1PPS_RX1PPS0_MASK                      equ 0001h
RX1PPS_RX1PPS1_POSN                      equ 0001h
RX1PPS_RX1PPS1_POSITION                  equ 0001h
RX1PPS_RX1PPS1_SIZE                      equ 0001h
RX1PPS_RX1PPS1_LENGTH                    equ 0001h
RX1PPS_RX1PPS1_MASK                      equ 0002h
RX1PPS_RX1PPS2_POSN                      equ 0002h
RX1PPS_RX1PPS2_POSITION                  equ 0002h
RX1PPS_RX1PPS2_SIZE                      equ 0001h
RX1PPS_RX1PPS2_LENGTH                    equ 0001h
RX1PPS_RX1PPS2_MASK                      equ 0004h
RX1PPS_RX1PPS3_POSN                      equ 0003h
RX1PPS_RX1PPS3_POSITION                  equ 0003h
RX1PPS_RX1PPS3_SIZE                      equ 0001h
RX1PPS_RX1PPS3_LENGTH                    equ 0001h
RX1PPS_RX1PPS3_MASK                      equ 0008h
RX1PPS_RX1PPS4_POSN                      equ 0004h
RX1PPS_RX1PPS4_POSITION                  equ 0004h
RX1PPS_RX1PPS4_SIZE                      equ 0001h
RX1PPS_RX1PPS4_LENGTH                    equ 0001h
RX1PPS_RX1PPS4_MASK                      equ 0010h

// Register: CK1PPS
#define CK1PPS CK1PPS
CK1PPS                                   equ 0EB6h
// bitfield definitions
CK1PPS_PIN_POSN                          equ 0000h
CK1PPS_PIN_POSITION                      equ 0000h
CK1PPS_PIN_SIZE                          equ 0003h
CK1PPS_PIN_LENGTH                        equ 0003h
CK1PPS_PIN_MASK                          equ 0007h
CK1PPS_PORT_POSN                         equ 0003h
CK1PPS_PORT_POSITION                     equ 0003h
CK1PPS_PORT_SIZE                         equ 0002h
CK1PPS_PORT_LENGTH                       equ 0002h
CK1PPS_PORT_MASK                         equ 0018h
CK1PPS_TXPPS_POSN                        equ 0000h
CK1PPS_TXPPS_POSITION                    equ 0000h
CK1PPS_TXPPS_SIZE                        equ 0005h
CK1PPS_TXPPS_LENGTH                      equ 0005h
CK1PPS_TXPPS_MASK                        equ 001Fh
CK1PPS_TXPPS0_POSN                       equ 0000h
CK1PPS_TXPPS0_POSITION                   equ 0000h
CK1PPS_TXPPS0_SIZE                       equ 0001h
CK1PPS_TXPPS0_LENGTH                     equ 0001h
CK1PPS_TXPPS0_MASK                       equ 0001h
CK1PPS_TXPPS1_POSN                       equ 0001h
CK1PPS_TXPPS1_POSITION                   equ 0001h
CK1PPS_TXPPS1_SIZE                       equ 0001h
CK1PPS_TXPPS1_LENGTH                     equ 0001h
CK1PPS_TXPPS1_MASK                       equ 0002h
CK1PPS_TXPPS2_POSN                       equ 0002h
CK1PPS_TXPPS2_POSITION                   equ 0002h
CK1PPS_TXPPS2_SIZE                       equ 0001h
CK1PPS_TXPPS2_LENGTH                     equ 0001h
CK1PPS_TXPPS2_MASK                       equ 0004h
CK1PPS_TXPPS3_POSN                       equ 0003h
CK1PPS_TXPPS3_POSITION                   equ 0003h
CK1PPS_TXPPS3_SIZE                       equ 0001h
CK1PPS_TXPPS3_LENGTH                     equ 0001h
CK1PPS_TXPPS3_MASK                       equ 0008h
CK1PPS_TXPPS4_POSN                       equ 0004h
CK1PPS_TXPPS4_POSITION                   equ 0004h
CK1PPS_TXPPS4_SIZE                       equ 0001h
CK1PPS_TXPPS4_LENGTH                     equ 0001h
CK1PPS_TXPPS4_MASK                       equ 0010h
CK1PPS_TX1PPS_POSN                       equ 0000h
CK1PPS_TX1PPS_POSITION                   equ 0000h
CK1PPS_TX1PPS_SIZE                       equ 0005h
CK1PPS_TX1PPS_LENGTH                     equ 0005h
CK1PPS_TX1PPS_MASK                       equ 001Fh
CK1PPS_TX1PPS0_POSN                      equ 0000h
CK1PPS_TX1PPS0_POSITION                  equ 0000h
CK1PPS_TX1PPS0_SIZE                      equ 0001h
CK1PPS_TX1PPS0_LENGTH                    equ 0001h
CK1PPS_TX1PPS0_MASK                      equ 0001h
CK1PPS_TX1PPS1_POSN                      equ 0001h
CK1PPS_TX1PPS1_POSITION                  equ 0001h
CK1PPS_TX1PPS1_SIZE                      equ 0001h
CK1PPS_TX1PPS1_LENGTH                    equ 0001h
CK1PPS_TX1PPS1_MASK                      equ 0002h
CK1PPS_TX1PPS2_POSN                      equ 0002h
CK1PPS_TX1PPS2_POSITION                  equ 0002h
CK1PPS_TX1PPS2_SIZE                      equ 0001h
CK1PPS_TX1PPS2_LENGTH                    equ 0001h
CK1PPS_TX1PPS2_MASK                      equ 0004h
CK1PPS_TX1PPS3_POSN                      equ 0003h
CK1PPS_TX1PPS3_POSITION                  equ 0003h
CK1PPS_TX1PPS3_SIZE                      equ 0001h
CK1PPS_TX1PPS3_LENGTH                    equ 0001h
CK1PPS_TX1PPS3_MASK                      equ 0008h
CK1PPS_TX1PPS4_POSN                      equ 0004h
CK1PPS_TX1PPS4_POSITION                  equ 0004h
CK1PPS_TX1PPS4_SIZE                      equ 0001h
CK1PPS_TX1PPS4_LENGTH                    equ 0001h
CK1PPS_TX1PPS4_MASK                      equ 0010h

