GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k40.inc
// Register: CRCCON1
#define CRCCON1 CRCCON1
CRCCON1                                  equ 0F7Dh
// bitfield definitions
CRCCON1_PLEN_POSN                        equ 0000h
CRCCON1_PLEN_POSITION                    equ 0000h
CRCCON1_PLEN_SIZE                        equ 0004h
CRCCON1_PLEN_LENGTH                      equ 0004h
CRCCON1_PLEN_MASK                        equ 000Fh
CRCCON1_DLEN_POSN                        equ 0004h
CRCCON1_DLEN_POSITION                    equ 0004h
CRCCON1_DLEN_SIZE                        equ 0004h
CRCCON1_DLEN_LENGTH                      equ 0004h
CRCCON1_DLEN_MASK                        equ 00F0h
CRCCON1_PLEN0_POSN                       equ 0000h
CRCCON1_PLEN0_POSITION                   equ 0000h
CRCCON1_PLEN0_SIZE                       equ 0001h
CRCCON1_PLEN0_LENGTH                     equ 0001h
CRCCON1_PLEN0_MASK                       equ 0001h
CRCCON1_PLEN1_POSN                       equ 0001h
CRCCON1_PLEN1_POSITION                   equ 0001h
CRCCON1_PLEN1_SIZE                       equ 0001h
CRCCON1_PLEN1_LENGTH                     equ 0001h
CRCCON1_PLEN1_MASK                       equ 0002h
CRCCON1_PLEN2_POSN                       equ 0002h
CRCCON1_PLEN2_POSITION                   equ 0002h
CRCCON1_PLEN2_SIZE                       equ 0001h
CRCCON1_PLEN2_LENGTH                     equ 0001h
CRCCON1_PLEN2_MASK                       equ 0004h
CRCCON1_PLEN3_POSN                       equ 0003h
CRCCON1_PLEN3_POSITION                   equ 0003h
CRCCON1_PLEN3_SIZE                       equ 0001h
CRCCON1_PLEN3_LENGTH                     equ 0001h
CRCCON1_PLEN3_MASK                       equ 0008h
CRCCON1_DLEN0_POSN                       equ 0004h
CRCCON1_DLEN0_POSITION                   equ 0004h
CRCCON1_DLEN0_SIZE                       equ 0001h
CRCCON1_DLEN0_LENGTH                     equ 0001h
CRCCON1_DLEN0_MASK                       equ 0010h
CRCCON1_DLEN1_POSN                       equ 0005h
CRCCON1_DLEN1_POSITION                   equ 0005h
CRCCON1_DLEN1_SIZE                       equ 0001h
CRCCON1_DLEN1_LENGTH                     equ 0001h
CRCCON1_DLEN1_MASK                       equ 0020h
CRCCON1_DLEN2_POSN                       equ 0006h
CRCCON1_DLEN2_POSITION                   equ 0006h
CRCCON1_DLEN2_SIZE                       equ 0001h
CRCCON1_DLEN2_LENGTH                     equ 0001h
CRCCON1_DLEN2_MASK                       equ 0040h
CRCCON1_DLEN3_POSN                       equ 0007h
CRCCON1_DLEN3_POSITION                   equ 0007h
CRCCON1_DLEN3_SIZE                       equ 0001h
CRCCON1_DLEN3_LENGTH                     equ 0001h
CRCCON1_DLEN3_MASK                       equ 0080h

// Register: NVMADR
#define NVMADR NVMADR
NVMADR                                   equ 0F7Eh
// bitfield definitions
NVMADR_ADR_POSN                          equ 0000h
NVMADR_ADR_POSITION                      equ 0000h
NVMADR_ADR_SIZE                          equ 0008h
NVMADR_ADR_LENGTH                        equ 0008h
NVMADR_ADR_MASK                          equ 00FFh
NVMADR_ADR0_POSN                         equ 0000h
NVMADR_ADR0_POSITION                     equ 0000h
NVMADR_ADR0_SIZE                         equ 0001h
NVMADR_ADR0_LENGTH                       equ 0001h
NVMADR_ADR0_MASK                         equ 0001h
NVMADR_ADR1_POSN                         equ 0001h
NVMADR_ADR1_POSITION                     equ 0001h
NVMADR_ADR1_SIZE                         equ 0001h
NVMADR_ADR1_LENGTH                       equ 0001h
NVMADR_ADR1_MASK                         equ 0002h
NVMADR_ADR2_POSN                         equ 0002h
NVMADR_ADR2_POSITION                     equ 0002h
NVMADR_ADR2_SIZE                         equ 0001h
NVMADR_ADR2_LENGTH                       equ 0001h
NVMADR_ADR2_MASK                         equ 0004h
NVMADR_ADR3_POSN                         equ 0003h
NVMADR_ADR3_POSITION                     equ 0003h
NVMADR_ADR3_SIZE                         equ 0001h
NVMADR_ADR3_LENGTH                       equ 0001h
NVMADR_ADR3_MASK                         equ 0008h
NVMADR_ADR4_POSN                         equ 0004h
NVMADR_ADR4_POSITION                     equ 0004h
NVMADR_ADR4_SIZE                         equ 0001h
NVMADR_ADR4_LENGTH                       equ 0001h
NVMADR_ADR4_MASK                         equ 0010h
NVMADR_ADR5_POSN                         equ 0005h
NVMADR_ADR5_POSITION                     equ 0005h
NVMADR_ADR5_SIZE                         equ 0001h
NVMADR_ADR5_LENGTH                       equ 0001h
NVMADR_ADR5_MASK                         equ 0020h
NVMADR_ADR6_POSN                         equ 0006h
NVMADR_ADR6_POSITION                     equ 0006h
NVMADR_ADR6_SIZE                         equ 0001h
NVMADR_ADR6_LENGTH                       equ 0001h
NVMADR_ADR6_MASK                         equ 0040h
NVMADR_ADR7_POSN                         equ 0007h
NVMADR_ADR7_POSITION                     equ 0007h
NVMADR_ADR7_SIZE                         equ 0001h
NVMADR_ADR7_LENGTH                       equ 0001h
NVMADR_ADR7_MASK                         equ 0080h
NVMADR_NVMADR0_POSN                      equ 0000h
NVMADR_NVMADR0_POSITION                  equ 0000h
NVMADR_NVMADR0_SIZE                      equ 0001h
NVMADR_NVMADR0_LENGTH                    equ 0001h
NVMADR_NVMADR0_MASK                      equ 0001h
NVMADR_NVMADR1_POSN                      equ 0001h
NVMADR_NVMADR1_POSITION                  equ 0001h
NVMADR_NVMADR1_SIZE                      equ 0001h
NVMADR_NVMADR1_LENGTH                    equ 0001h
NVMADR_NVMADR1_MASK                      equ 0002h
NVMADR_NVMADR2_POSN                      equ 0002h
NVMADR_NVMADR2_POSITION                  equ 0002h
NVMADR_NVMADR2_SIZE                      equ 0001h
NVMADR_NVMADR2_LENGTH                    equ 0001h
NVMADR_NVMADR2_MASK                      equ 0004h
NVMADR_NVMADR3_POSN                      equ 0003h
NVMADR_NVMADR3_POSITION                  equ 0003h
NVMADR_NVMADR3_SIZE                      equ 0001h
NVMADR_NVMADR3_LENGTH                    equ 0001h
NVMADR_NVMADR3_MASK                      equ 0008h
NVMADR_NVMADR4_POSN                      equ 0004h
NVMADR_NVMADR4_POSITION                  equ 0004h
NVMADR_NVMADR4_SIZE                      equ 0001h
NVMADR_NVMADR4_LENGTH                    equ 0001h
NVMADR_NVMADR4_MASK                      equ 0010h
NVMADR_NVMADR5_POSN                      equ 0005h
NVMADR_NVMADR5_POSITION                  equ 0005h
NVMADR_NVMADR5_SIZE                      equ 0001h
NVMADR_NVMADR5_LENGTH                    equ 0001h
NVMADR_NVMADR5_MASK                      equ 0020h
NVMADR_NVMADR6_POSN                      equ 0006h
NVMADR_NVMADR6_POSITION                  equ 0006h
NVMADR_NVMADR6_SIZE                      equ 0001h
NVMADR_NVMADR6_LENGTH                    equ 0001h
NVMADR_NVMADR6_MASK                      equ 0040h
NVMADR_NVMADR7_POSN                      equ 0007h
NVMADR_NVMADR7_POSITION                  equ 0007h
NVMADR_NVMADR7_SIZE                      equ 0001h
NVMADR_NVMADR7_LENGTH                    equ 0001h
NVMADR_NVMADR7_MASK                      equ 0080h
NVMADR_ADRL_POSN                         equ 0000h
NVMADR_ADRL_POSITION                     equ 0000h
NVMADR_ADRL_SIZE                         equ 0008h
NVMADR_ADRL_LENGTH                       equ 0008h
NVMADR_ADRL_MASK                         equ 00FFh

// Register: NVMDAT
#define NVMDAT NVMDAT
NVMDAT                                   equ 0F80h
// bitfield definitions
NVMDAT_NVMDAT_POSN                       equ 0000h
NVMDAT_NVMDAT_POSITION                   equ 0000h
NVMDAT_NVMDAT_SIZE                       equ 0008h
NVMDAT_NVMDAT_LENGTH                     equ 0008h
NVMDAT_NVMDAT_MASK                       equ 00FFh
NVMDAT_NVMDAT0_POSN                      equ 0000h
NVMDAT_NVMDAT0_POSITION                  equ 0000h
NVMDAT_NVMDAT0_SIZE                      equ 0001h
NVMDAT_NVMDAT0_LENGTH                    equ 0001h
NVMDAT_NVMDAT0_MASK                      equ 0001h
NVMDAT_NVMDAT1_POSN                      equ 0001h
NVMDAT_NVMDAT1_POSITION                  equ 0001h
NVMDAT_NVMDAT1_SIZE                      equ 0001h
NVMDAT_NVMDAT1_LENGTH                    equ 0001h
NVMDAT_NVMDAT1_MASK                      equ 0002h
NVMDAT_NVMDAT2_POSN                      equ 0002h
NVMDAT_NVMDAT2_POSITION                  equ 0002h
NVMDAT_NVMDAT2_SIZE                      equ 0001h
NVMDAT_NVMDAT2_LENGTH                    equ 0001h
NVMDAT_NVMDAT2_MASK                      equ 0004h
NVMDAT_NVMDAT3_POSN                      equ 0003h
NVMDAT_NVMDAT3_POSITION                  equ 0003h
NVMDAT_NVMDAT3_SIZE                      equ 0001h
NVMDAT_NVMDAT3_LENGTH                    equ 0001h
NVMDAT_NVMDAT3_MASK                      equ 0008h
NVMDAT_NVMDAT4_POSN                      equ 0004h
NVMDAT_NVMDAT4_POSITION                  equ 0004h
NVMDAT_NVMDAT4_SIZE                      equ 0001h
NVMDAT_NVMDAT4_LENGTH                    equ 0001h
NVMDAT_NVMDAT4_MASK                      equ 0010h
NVMDAT_NVMDAT5_POSN                      equ 0005h
NVMDAT_NVMDAT5_POSITION                  equ 0005h
NVMDAT_NVMDAT5_SIZE                      equ 0001h
NVMDAT_NVMDAT5_LENGTH                    equ 0001h
NVMDAT_NVMDAT5_MASK                      equ 0020h
NVMDAT_NVMDAT6_POSN                      equ 0006h
NVMDAT_NVMDAT6_POSITION                  equ 0006h
NVMDAT_NVMDAT6_SIZE                      equ 0001h
NVMDAT_NVMDAT6_LENGTH                    equ 0001h
NVMDAT_NVMDAT6_MASK                      equ 0040h
NVMDAT_NVMDAT7_POSN                      equ 0007h
NVMDAT_NVMDAT7_POSITION                  equ 0007h
NVMDAT_NVMDAT7_SIZE                      equ 0001h
NVMDAT_NVMDAT7_LENGTH                    equ 0001h
NVMDAT_NVMDAT7_MASK                      equ 0080h

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 0F81h
// bitfield definitions
NVMCON1_RD_POSN                          equ 0000h
NVMCON1_RD_POSITION                      equ 0000h
NVMCON1_RD_SIZE                          equ 0001h
NVMCON1_RD_LENGTH                        equ 0001h
NVMCON1_RD_MASK                          equ 0001h
NVMCON1_WR_POSN                          equ 0001h
NVMCON1_WR_POSITION                      equ 0001h
NVMCON1_WR_SIZE                          equ 0001h
NVMCON1_WR_LENGTH                        equ 0001h
NVMCON1_WR_MASK                          equ 0002h
NVMCON1_WREN_POSN                        equ 0002h
NVMCON1_WREN_POSITION                    equ 0002h
NVMCON1_WREN_SIZE                        equ 0001h
NVMCON1_WREN_LENGTH                      equ 0001h
NVMCON1_WREN_MASK                        equ 0004h
NVMCON1_WRERR_POSN                       equ 0003h
NVMCON1_WRERR_POSITION                   equ 0003h
NVMCON1_WRERR_SIZE                       equ 0001h
NVMCON1_WRERR_LENGTH                     equ 0001h
NVMCON1_WRERR_MASK                       equ 0008h
NVMCON1_FREE_POSN                        equ 0004h
NVMCON1_FREE_POSITION                    equ 0004h
NVMCON1_FREE_SIZE                        equ 0001h
NVMCON1_FREE_LENGTH                      equ 0001h
NVMCON1_FREE_MASK                        equ 0010h
NVMCON1_NVMREG_POSN                      equ 0006h
NVMCON1_NVMREG_POSITION                  equ 0006h
NVMCON1_NVMREG_SIZE                      equ 0002h
NVMCON1_NVMREG_LENGTH                    equ 0002h
NVMCON1_NVMREG_MASK                      equ 00C0h
NVMCON1_NVMREG0_POSN                     equ 0006h
NVMCON1_NVMREG0_POSITION                 equ 0006h
NVMCON1_NVMREG0_SIZE                     equ 0001h
NVMCON1_NVMREG0_LENGTH                   equ 0001h
NVMCON1_NVMREG0_MASK                     equ 0040h
NVMCON1_NVMREG1_POSN                     equ 0007h
NVMCON1_NVMREG1_POSITION                 equ 0007h
NVMCON1_NVMREG1_SIZE                     equ 0001h
NVMCON1_NVMREG1_LENGTH                   equ 0001h
NVMCON1_NVMREG1_MASK                     equ 0080h

// Register: NVMCON2
#define NVMCON2 NVMCON2
NVMCON2                                  equ 0F82h
// bitfield definitions
NVMCON2_NVMCON2_POSN                     equ 0000h
NVMCON2_NVMCON2_POSITION                 equ 0000h
NVMCON2_NVMCON2_SIZE                     equ 0008h
NVMCON2_NVMCON2_LENGTH                   equ 0008h
NVMCON2_NVMCON2_MASK                     equ 00FFh

