GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k40.inc
// Register: T0CON1
#define T0CON1 T0CON1
T0CON1                                   equ 0FD6h
// bitfield definitions
T0CON1_T0CKPS_POSN                       equ 0000h
T0CON1_T0CKPS_POSITION                   equ 0000h
T0CON1_T0CKPS_SIZE                       equ 0004h
T0CON1_T0CKPS_LENGTH                     equ 0004h
T0CON1_T0CKPS_MASK                       equ 000Fh
T0CON1_T0ASYNC_POSN                      equ 0004h
T0CON1_T0ASYNC_POSITION                  equ 0004h
T0CON1_T0ASYNC_SIZE                      equ 0001h
T0CON1_T0ASYNC_LENGTH                    equ 0001h
T0CON1_T0ASYNC_MASK                      equ 0010h
T0CON1_T0CS_POSN                         equ 0005h
T0CON1_T0CS_POSITION                     equ 0005h
T0CON1_T0CS_SIZE                         equ 0003h
T0CON1_T0CS_LENGTH                       equ 0003h
T0CON1_T0CS_MASK                         equ 00E0h
T0CON1_T0CKPS0_POSN                      equ 0000h
T0CON1_T0CKPS0_POSITION                  equ 0000h
T0CON1_T0CKPS0_SIZE                      equ 0001h
T0CON1_T0CKPS0_LENGTH                    equ 0001h
T0CON1_T0CKPS0_MASK                      equ 0001h
T0CON1_T0CKPS1_POSN                      equ 0001h
T0CON1_T0CKPS1_POSITION                  equ 0001h
T0CON1_T0CKPS1_SIZE                      equ 0001h
T0CON1_T0CKPS1_LENGTH                    equ 0001h
T0CON1_T0CKPS1_MASK                      equ 0002h
T0CON1_T0CKPS2_POSN                      equ 0002h
T0CON1_T0CKPS2_POSITION                  equ 0002h
T0CON1_T0CKPS2_SIZE                      equ 0001h
T0CON1_T0CKPS2_LENGTH                    equ 0001h
T0CON1_T0CKPS2_MASK                      equ 0004h
T0CON1_T0CKPS3_POSN                      equ 0003h
T0CON1_T0CKPS3_POSITION                  equ 0003h
T0CON1_T0CKPS3_SIZE                      equ 0001h
T0CON1_T0CKPS3_LENGTH                    equ 0001h
T0CON1_T0CKPS3_MASK                      equ 0008h
T0CON1_T0CS0_POSN                        equ 0005h
T0CON1_T0CS0_POSITION                    equ 0005h
T0CON1_T0CS0_SIZE                        equ 0001h
T0CON1_T0CS0_LENGTH                      equ 0001h
T0CON1_T0CS0_MASK                        equ 0020h
T0CON1_T0CS1_POSN                        equ 0006h
T0CON1_T0CS1_POSITION                    equ 0006h
T0CON1_T0CS1_SIZE                        equ 0001h
T0CON1_T0CS1_LENGTH                      equ 0001h
T0CON1_T0CS1_MASK                        equ 0040h
T0CON1_T0CS2_POSN                        equ 0007h
T0CON1_T0CS2_POSITION                    equ 0007h
T0CON1_T0CS2_SIZE                        equ 0001h
T0CON1_T0CS2_LENGTH                      equ 0001h
T0CON1_T0CS2_MASK                        equ 0080h
T0CON1_T0PS0_POSN                        equ 0000h
T0CON1_T0PS0_POSITION                    equ 0000h
T0CON1_T0PS0_SIZE                        equ 0001h
T0CON1_T0PS0_LENGTH                      equ 0001h
T0CON1_T0PS0_MASK                        equ 0001h
T0CON1_T0PS1_POSN                        equ 0001h
T0CON1_T0PS1_POSITION                    equ 0001h
T0CON1_T0PS1_SIZE                        equ 0001h
T0CON1_T0PS1_LENGTH                      equ 0001h
T0CON1_T0PS1_MASK                        equ 0002h
T0CON1_T0PS2_POSN                        equ 0002h
T0CON1_T0PS2_POSITION                    equ 0002h
T0CON1_T0PS2_SIZE                        equ 0001h
T0CON1_T0PS2_LENGTH                      equ 0001h
T0CON1_T0PS2_MASK                        equ 0004h
T0CON1_T0PS3_POSN                        equ 0003h
T0CON1_T0PS3_POSITION                    equ 0003h
T0CON1_T0PS3_SIZE                        equ 0001h
T0CON1_T0PS3_LENGTH                      equ 0001h
T0CON1_T0PS3_MASK                        equ 0008h
T0CON1_T0PS_POSN                         equ 0000h
T0CON1_T0PS_POSITION                     equ 0000h
T0CON1_T0PS_SIZE                         equ 0004h
T0CON1_T0PS_LENGTH                       equ 0004h
T0CON1_T0PS_MASK                         equ 000Fh

// Register: PCON0
#define PCON0 PCON0
PCON0                                    equ 0FD7h
// bitfield definitions
PCON0_NOT_BOR_POSN                       equ 0000h
PCON0_NOT_BOR_POSITION                   equ 0000h
PCON0_NOT_BOR_SIZE                       equ 0001h
PCON0_NOT_BOR_LENGTH                     equ 0001h
PCON0_NOT_BOR_MASK                       equ 0001h
PCON0_NOT_POR_POSN                       equ 0001h
PCON0_NOT_POR_POSITION                   equ 0001h
PCON0_NOT_POR_SIZE                       equ 0001h
PCON0_NOT_POR_LENGTH                     equ 0001h
PCON0_NOT_POR_MASK                       equ 0002h
PCON0_NOT_RI_POSN                        equ 0002h
PCON0_NOT_RI_POSITION                    equ 0002h
PCON0_NOT_RI_SIZE                        equ 0001h
PCON0_NOT_RI_LENGTH                      equ 0001h
PCON0_NOT_RI_MASK                        equ 0004h
PCON0_NOT_RMCLR_POSN                     equ 0003h
PCON0_NOT_RMCLR_POSITION                 equ 0003h
PCON0_NOT_RMCLR_SIZE                     equ 0001h
PCON0_NOT_RMCLR_LENGTH                   equ 0001h
PCON0_NOT_RMCLR_MASK                     equ 0008h
PCON0_NOT_RWDT_POSN                      equ 0004h
PCON0_NOT_RWDT_POSITION                  equ 0004h
PCON0_NOT_RWDT_SIZE                      equ 0001h
PCON0_NOT_RWDT_LENGTH                    equ 0001h
PCON0_NOT_RWDT_MASK                      equ 0010h
PCON0_NOT_WDTWV_POSN                     equ 0005h
PCON0_NOT_WDTWV_POSITION                 equ 0005h
PCON0_NOT_WDTWV_SIZE                     equ 0001h
PCON0_NOT_WDTWV_LENGTH                   equ 0001h
PCON0_NOT_WDTWV_MASK                     equ 0020h
PCON0_nBOR_POSN                          equ 0000h
PCON0_nBOR_POSITION                      equ 0000h
PCON0_nBOR_SIZE                          equ 0001h
PCON0_nBOR_LENGTH                        equ 0001h
PCON0_nBOR_MASK                          equ 0001h
PCON0_nPOR_POSN                          equ 0001h
PCON0_nPOR_POSITION                      equ 0001h
PCON0_nPOR_SIZE                          equ 0001h
PCON0_nPOR_LENGTH                        equ 0001h
PCON0_nPOR_MASK                          equ 0002h
PCON0_nRI_POSN                           equ 0002h
PCON0_nRI_POSITION                       equ 0002h
PCON0_nRI_SIZE                           equ 0001h
PCON0_nRI_LENGTH                         equ 0001h
PCON0_nRI_MASK                           equ 0004h
PCON0_nRMCLR_POSN                        equ 0003h
PCON0_nRMCLR_POSITION                    equ 0003h
PCON0_nRMCLR_SIZE                        equ 0001h
PCON0_nRMCLR_LENGTH                      equ 0001h
PCON0_nRMCLR_MASK                        equ 0008h
PCON0_nRWDT_POSN                         equ 0004h
PCON0_nRWDT_POSITION                     equ 0004h
PCON0_nRWDT_SIZE                         equ 0001h
PCON0_nRWDT_LENGTH                       equ 0001h
PCON0_nRWDT_MASK                         equ 0010h
PCON0_nWDTWV_POSN                        equ 0005h
PCON0_nWDTWV_POSITION                    equ 0005h
PCON0_nWDTWV_SIZE                        equ 0001h
PCON0_nWDTWV_LENGTH                      equ 0001h
PCON0_nWDTWV_MASK                        equ 0020h
PCON0_STKUNF_POSN                        equ 0006h
PCON0_STKUNF_POSITION                    equ 0006h
PCON0_STKUNF_SIZE                        equ 0001h
PCON0_STKUNF_LENGTH                      equ 0001h
PCON0_STKUNF_MASK                        equ 0040h
PCON0_STKOVF_POSN                        equ 0007h
PCON0_STKOVF_POSITION                    equ 0007h
PCON0_STKOVF_SIZE                        equ 0001h
PCON0_STKOVF_LENGTH                      equ 0001h
PCON0_STKOVF_MASK                        equ 0080h
PCON0_BOR_POSN                           equ 0000h
PCON0_BOR_POSITION                       equ 0000h
PCON0_BOR_SIZE                           equ 0001h
PCON0_BOR_LENGTH                         equ 0001h
PCON0_BOR_MASK                           equ 0001h
PCON0_POR_POSN                           equ 0001h
PCON0_POR_POSITION                       equ 0001h
PCON0_POR_SIZE                           equ 0001h
PCON0_POR_LENGTH                         equ 0001h
PCON0_POR_MASK                           equ 0002h
PCON0_RI_POSN                            equ 0002h
PCON0_RI_POSITION                        equ 0002h
PCON0_RI_SIZE                            equ 0001h
PCON0_RI_LENGTH                          equ 0001h
PCON0_RI_MASK                            equ 0004h
PCON0_RMCLR_POSN                         equ 0003h
PCON0_RMCLR_POSITION                     equ 0003h
PCON0_RMCLR_SIZE                         equ 0001h
PCON0_RMCLR_LENGTH                       equ 0001h
PCON0_RMCLR_MASK                         equ 0008h
PCON0_RWDT_POSN                          equ 0004h
PCON0_RWDT_POSITION                      equ 0004h
PCON0_RWDT_SIZE                          equ 0001h
PCON0_RWDT_LENGTH                        equ 0001h
PCON0_RWDT_MASK                          equ 0010h
PCON0_WDTWV_POSN                         equ 0005h
PCON0_WDTWV_POSITION                     equ 0005h
PCON0_WDTWV_SIZE                         equ 0001h
PCON0_WDTWV_LENGTH                       equ 0001h
PCON0_WDTWV_MASK                         equ 0020h

// Register: STATUS
#define STATUS STATUS
STATUS                                   equ 0FD8h
// bitfield definitions
STATUS_NOT_PD_POSN                       equ 0005h
STATUS_NOT_PD_POSITION                   equ 0005h
STATUS_NOT_PD_SIZE                       equ 0001h
STATUS_NOT_PD_LENGTH                     equ 0001h
STATUS_NOT_PD_MASK                       equ 0020h
STATUS_NOT_TO_POSN                       equ 0006h
STATUS_NOT_TO_POSITION                   equ 0006h
STATUS_NOT_TO_SIZE                       equ 0001h
STATUS_NOT_TO_LENGTH                     equ 0001h
STATUS_NOT_TO_MASK                       equ 0040h
STATUS_C_POSN                            equ 0000h
STATUS_C_POSITION                        equ 0000h
STATUS_C_SIZE                            equ 0001h
STATUS_C_LENGTH                          equ 0001h
STATUS_C_MASK                            equ 0001h
STATUS_DC_POSN                           equ 0001h
STATUS_DC_POSITION                       equ 0001h
STATUS_DC_SIZE                           equ 0001h
STATUS_DC_LENGTH                         equ 0001h
STATUS_DC_MASK                           equ 0002h
STATUS_Z_POSN                            equ 0002h
STATUS_Z_POSITION                        equ 0002h
STATUS_Z_SIZE                            equ 0001h
STATUS_Z_LENGTH                          equ 0001h
STATUS_Z_MASK                            equ 0004h
STATUS_OV_POSN                           equ 0003h
STATUS_OV_POSITION                       equ 0003h
STATUS_OV_SIZE                           equ 0001h
STATUS_OV_LENGTH                         equ 0001h
STATUS_OV_MASK                           equ 0008h
STATUS_N_POSN                            equ 0004h
STATUS_N_POSITION                        equ 0004h
STATUS_N_SIZE                            equ 0001h
STATUS_N_LENGTH                          equ 0001h
STATUS_N_MASK                            equ 0010h
STATUS_nPD_POSN                          equ 0005h
STATUS_nPD_POSITION                      equ 0005h
STATUS_nPD_SIZE                          equ 0001h
STATUS_nPD_LENGTH                        equ 0001h
STATUS_nPD_MASK                          equ 0020h
STATUS_nTO_POSN                          equ 0006h
STATUS_nTO_POSITION                      equ 0006h
STATUS_nTO_SIZE                          equ 0001h
STATUS_nTO_LENGTH                        equ 0001h
STATUS_nTO_MASK                          equ 0040h
STATUS_PD_POSN                           equ 0005h
STATUS_PD_POSITION                       equ 0005h
STATUS_PD_SIZE                           equ 0001h
STATUS_PD_LENGTH                         equ 0001h
STATUS_PD_MASK                           equ 0020h
STATUS_TO_POSN                           equ 0006h
STATUS_TO_POSITION                       equ 0006h
STATUS_TO_SIZE                           equ 0001h
STATUS_TO_LENGTH                         equ 0001h
STATUS_TO_MASK                           equ 0040h
STATUS_CARRY_POSN                        equ 0000h
STATUS_CARRY_POSITION                    equ 0000h
STATUS_CARRY_SIZE                        equ 0001h
STATUS_CARRY_LENGTH                      equ 0001h
STATUS_CARRY_MASK                        equ 0001h
STATUS_ZERO_POSN                         equ 0002h
STATUS_ZERO_POSITION                     equ 0002h
STATUS_ZERO_SIZE                         equ 0001h
STATUS_ZERO_LENGTH                       equ 0001h
STATUS_ZERO_MASK                         equ 0004h
STATUS_OVERFLOW_POSN                     equ 0003h
STATUS_OVERFLOW_POSITION                 equ 0003h
STATUS_OVERFLOW_SIZE                     equ 0001h
STATUS_OVERFLOW_LENGTH                   equ 0001h
STATUS_OVERFLOW_MASK                     equ 0008h
STATUS_NEGATIVE_POSN                     equ 0004h
STATUS_NEGATIVE_POSITION                 equ 0004h
STATUS_NEGATIVE_SIZE                     equ 0001h
STATUS_NEGATIVE_LENGTH                   equ 0001h
STATUS_NEGATIVE_MASK                     equ 0010h

// Register: FSR2
#define FSR2 FSR2
FSR2                                     equ 0FD9h

// Register: FSR2L
#define FSR2L FSR2L
FSR2L                                    equ 0FD9h
// bitfield definitions
FSR2L_FSR2L_POSN                         equ 0000h
FSR2L_FSR2L_POSITION                     equ 0000h
FSR2L_FSR2L_SIZE                         equ 0008h
FSR2L_FSR2L_LENGTH                       equ 0008h
FSR2L_FSR2L_MASK                         equ 00FFh

// Register: FSR2H
#define FSR2H FSR2H
FSR2H                                    equ 0FDAh

// Register: PLUSW2
#define PLUSW2 PLUSW2
PLUSW2                                   equ 0FDBh
// bitfield definitions
PLUSW2_PLUSW2_POSN                       equ 0000h
PLUSW2_PLUSW2_POSITION                   equ 0000h
PLUSW2_PLUSW2_SIZE                       equ 0008h
PLUSW2_PLUSW2_LENGTH                     equ 0008h
PLUSW2_PLUSW2_MASK                       equ 00FFh

// Register: PREINC2
#define PREINC2 PREINC2
PREINC2                                  equ 0FDCh
// bitfield definitions
PREINC2_PREINC2_POSN                     equ 0000h
PREINC2_PREINC2_POSITION                 equ 0000h
PREINC2_PREINC2_SIZE                     equ 0008h
PREINC2_PREINC2_LENGTH                   equ 0008h
PREINC2_PREINC2_MASK                     equ 00FFh

// Register: POSTDEC2
#define POSTDEC2 POSTDEC2
POSTDEC2                                 equ 0FDDh
// bitfield definitions
POSTDEC2_POSTDEC2_POSN                   equ 0000h
POSTDEC2_POSTDEC2_POSITION               equ 0000h
POSTDEC2_POSTDEC2_SIZE                   equ 0008h
POSTDEC2_POSTDEC2_LENGTH                 equ 0008h
POSTDEC2_POSTDEC2_MASK                   equ 00FFh

// Register: POSTINC2
#define POSTINC2 POSTINC2
POSTINC2                                 equ 0FDEh
// bitfield definitions
POSTINC2_POSTINC2_POSN                   equ 0000h
POSTINC2_POSTINC2_POSITION               equ 0000h
POSTINC2_POSTINC2_SIZE                   equ 0008h
POSTINC2_POSTINC2_LENGTH                 equ 0008h
POSTINC2_POSTINC2_MASK                   equ 00FFh

// Register: INDF2
#define INDF2 INDF2
INDF2                                    equ 0FDFh
// bitfield definitions
INDF2_INDF2_POSN                         equ 0000h
INDF2_INDF2_POSITION                     equ 0000h
INDF2_INDF2_SIZE                         equ 0008h
INDF2_INDF2_LENGTH                       equ 0008h
INDF2_INDF2_MASK                         equ 00FFh

